<template>
  <div>
    <div class="login-logo">
      <svg-icon name="logo" />
    </div>
    <div class="agreement">
      <div class="agreement-content">
        <div class="headline">全真云实时渲染云用户服务协议</div>
        <div class="effect">版本生效日期：2023年4月10日</div>
        <div class="title">一 总则</div>
        <div class="section">
          用户在使用全真云实时渲染云（以下简称“全真云”）的服务之前，请您务必审慎阅读《全真云实时渲染云用户服务协议》（以下简称“本协议”），并充分理解各条款内容中规定的所有权利和限制及免责条款，在确认充分理解后选择接受或不接受本协议；一旦您点击“同意”或“下一步”，或您使用全真云服务，或者以其他任何明示或者默示方式表示接受本协议的，均视为您已阅读并同意签署本协议。
        </div>
        <div class="section">
          本协议即在您与全真云之间产生法律效力，成为对双方均具有约束力的法律文件。如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人（以下简称"监护人"）的陪同下阅读和判断是否同意本协议，并特别注意未成年人使用条款。<span
            class="weight"
          >
            限制、免责条款或者其他涉及您重大权益的条款可能以加粗、加下划线等形式提示您重点注意。</span
          >
        </div>
        <div class="section">本协议由上海芯赛云计算科技有限公司定期更新，最终解释权归上海芯赛云计算科技有限公司所有。</div>
        <div class="title">二 签约主体及协议范围</div>
        <div class="section">
          2.1本协议是用户与上海芯赛云计算科技有限公司之间关于其使用全真云的服务所订立的协议。“全真云”是指全真云和/或其相关服务可能存在的运营关联单位。“用户”是指全真云的服务的使用人，在本协议中更多地称为“您”。
        </div>
        <div class="section">
          2.2全真云的服务是指全真云向用户提供的，包括但不限于实时渲染及服务，具体服务以全真云实际提供的为准（以下简称“本服务”）。如您使用或购买全真云网站上某一具体实时渲染云服务，您仍需确认接受具体服务对应的服务条款。
        </div>
        <div class="title">三 关于本服务</div>
        <div class="section">
          3.1本协议项下的服务是指全真云向您提供的包括但不限于目前已经推出的实时渲染及服务、API/SDK、示例应用及软件代码、及后续全真云可能推出的纳入云服务范畴内的其他服务产品及服务。全真云的产品及服务在官方网站（https://www.quanzhencloud.top,下称“全真云网站”）进行网页公告。
        </div>
        <div class="section">
          3.2您通过注册、登录全真云控制台可操作购买而获得对应的云服务，全真云将不断创新致力于向您提供更优体验，<span class="weight">
            您了解并同意全真云提供的服务形式和本质可不经事先通知您而不时变换。</span
          >
        </div>
        <div class="section">
          3.3全真云有权依照本协议约定方式就本协议的内容进行变更。<span class="weight">
            一旦本协议和/或有关服务内容发生变动，全真云将通过网页公告、站内信、短信等其中任何一种或多种方式予以公告或通知，若您在本协议相关内容变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的内容，也将遵循修改后的条款内容。</span
          >
        </div>
        <div class="section">
          3.4请您不时关注本协议及本协议项下服务有关内容，以便掌握相关变动情况。如果您不同意全真云变更的内容，您可以主动取消相应的服务。<span
            class="weight"
          >
            如果您在变更内容通告后30天内未主动取消本协议项下服务则视为接受本协议和/或有关服务的变更；变更内容通告后您如果仍继续使用全真云提供的服务亦构成对有关变更的接受。</span
          >
          如您针对变更内容有异议，应在上述约定期限内主动取消本协议项下服务。
        </div>
        <div class="title">四 服务资费</div>
        <div class="section">
          4.1全真云就本服务向您收取费用，具体价格体系及计费规则以全真云网站公布或双方另行签署的书面协议为准，您可自行选择具体服务类型进行购买。<span
            class="weight"
          >
            支付完成后，不可进行转让或要求退费。</span
          >
        </div>
        <div class="section">
          <span class="weight"
            >4.2全真云实时渲染云计算服务的计费方式、价格体系（价格、计费模式等）及计费规则将在全真云网站页面列明，全真云将以页面公布的当时有效的价格体系为准进行计费。</span
          >
        </div>
        <div class="section">4.3全真云保留在您未按照约定支付全部费用之前不向您提供服务和/或技术支持，或者终止服务和/或技术支持的权利。</div>
        <div class="section">
          4.4您完全理解全真云价格体系中所有的赠送服务项目（若有）或活动（若有）均为全真云在正常服务价格之外的一次性特别优惠，优惠内容不包括赠送服务项目的修改、更新及维护费用，并且赠送服务项目不可折价冲抵服务价格。
        </div>
        <div class="section">
          4.5您理解并同意，全真云保留随时调整价格体系、支付时限及支付方式等权利，全真云将尽合理范围内的最大努力，将前述调整及变化，提前通过官网公告、站内通知等方式告知您，请关注全真云官网、控制台站内信、短信等相关信息。
        </div>
        <div class="title">五 账号与密码安全</div>
        <div class="title2">5.1账号注册</div>
        <div class="section">5.1.1您在使用本服务时可能需要注册一个账号。关于您使用账号的具体规则，请仔细阅读并遵守相关协议。</div>
        <div class="section">
          5.1.2全真云特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。
        </div>
        <div class="section">
          5.1.3您在使用本服务过程中，可以为您使用的账号设置昵称、头像、签名、留言等信息。您应当保证这些信息的内容和形式符合法律法规（本协议中的“法律法规”指用户所属/所处地区、国家现行有效的法律、
          行政法规、司法解释、地方法规、地方规章、部门规章及其他规范性文件以及对于该等法律法规的不时修改和补充，以及相关政策规定等，下同）、公序良俗、社会公德以及全真云实时渲染平台规则，且不会侵害任何主体的合法权益。
        </div>
        <div class="section">
          5.1.4
          <span class="weight"> 当您在全真云服务网站创建账户时，您须向我们提供您在中华人民共和国境内手机号码，设置、确认您的登录密码。</span>
          您提供的手机号码为您的云服务账户，同时用于您注册、登录、绑定账户、密码找回时接受验证码，并且作为您与全真云指定的联系方式之一，用来接受相关业务通知（如新品上线、服务变更等）。
        </div>
        <div class="section">
          5.1.5在您注册完成全真云服务账户后，您应完成账户实名认证，进行实名认证为《中华人民共和国网络安全法》所规定的您的应尽义务。<span
            class="weight"
          >
            您应提供云服务账户对应的实名账户所有人姓名、单位名称、联系人姓名及其联系方式、通讯地址等信息，
            提供身份认证证照等资料（如您为自然人，则应提供身份证正反面照片；如您为企业法人，则应提供企业营业执照及法定代表人/负责人的身份证正反面照片）进行上传。如果您通过人脸识别进行实名认证或您选择购买的服务应当进行人脸识别核验的，
            您需要按人脸识别的步骤向我们提供面部特征的生物识别信息和您的身份证正、反面照片等信息。</span
          >
        </div>
        <div class="title2">5.2在您使用服务的过程中，我们将通过以下方式收集您的有关信息：</div>
        <div class="section">
          5.2.1<span class="weight">
            在您使用服务过程中，我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备所在位置相关信息（例如IP地址、GPS位置以及能够提供相关信息的Wi-Fi接入点、蓝牙和基站等传感器信息）。 </span
          >我们可能会将前面两类信息进行关联，以便我们能在不同设备上为您提供一致的服务。
        </div>
        <div class="section">
          <span class="weight">
            5.2.2当您使用我们的网站提供的服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网站记录等。
          </span>
        </div>
        <div class="section">
          <span class="weight">
            5.2.3基于您使用全真云服务而产生的用户的咨询记录、报障记录和针对用户故障的排障过程（如通信或通话记录），全真云将通过记录、分析这些信息以便更及时响应您的帮助请求，以及用于改进服务。
          </span>
        </div>
        <div class="section">
          5.3请您注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息的。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。
        </div>
        <div class="title2">
          5.4超出本协议约定收集您的用户信息的，我们会另行向您说明信息收集的范围与目的，并征得您的同意后方收集提供相应服务所必要的您的信息；如您选择不提供前述信息，将会影响到您使用相应产品，但不会影响您使用全真云基本功能和其他产品。
        </div>
        <div class="title2">5.5我们出于如下目的，将使用您提交以及我们收集的用户信息：</div>
        <div class="section">5.5.1为了向您提供服务（如实名认证信息、用来接收验证码的手机号是继续获得服务的前提）；</div>
        <div class="section">5.5.2为了维护、改进服务（如您提交的业务联系人手机、电子邮件等用来接收业务通知和进行业务 沟通）；</div>
        <div class="section">
          5.5.3在法律法规允许的前提下，向您推广、介绍产品<span class="weight">
            （如果您不想接收我们给您发送的商业性电子信息，您可通过短信提示回复退订或根据信息中提供的退订方式予以退订）；
          </span>
        </div>
        <div class="section">
          5.5.4信息共享与整合：为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或全真云服务相关协议、规则的情况，
          我们可能使用您的会员信息、并整合设备信息、有关网络日志以及我们关联公司、合作伙伴分享的信息，来判断您账户及交易风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施；
        </div>
        <div class="section">
          <span class="weight">
            5.5.5如超出收集用户信息时所声称的目的，或者在超出具有直接或合理关联的范围使用用户信息前，我们会再次向您告知并征得您的明示同意。</span
          >
        </div>
        <div class="section">5.6如果您需要变更您全真云账户的实名认证信息，您需通过工单、电话等方式联系全真云，按照全真云的要求进操作。</div>
        <div class="title2">5.7在以下情形中，您可以向我们提出删除用户信息的请求：</div>
        <div class="section">5.7.1如果我们处理用户信息的行为违反法律法规；</div>
        <div class="section">5.7.2如果我们收集、使用您的用户信息，却未征得您的明确同意；</div>
        <div class="section">5.7.3如果我们处理个人信息的行为严重违反了与您的约定。</div>
        <div class="section">
          5.8为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
        </div>
        <div class="section">
          5.9您了解并同意，为保证账户和交易安全，全真云有权随时要求您完成全真云账户的实名认证；同时，全真云可能会就某些产品或服务的开通，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的账户只有在通过这些认证和验证之后，方可获得使用相关产品或服务的资格。
        </div>
        <div class="title">六 用户个人信息保护</div>
        <div class="section weight">
          6.1保护用户个人信息是全真云的一项基本原则。您在注册账号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则可能无法使用本服务或在使用过程中受到限制。
        </div>
        <div class="section">
          6.2一般情况下，您可根据相关产品规则浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
        </div>
        <div class="section">6.3全真云将尽可能运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</div>
        <div class="section weight">6.4我们不会将您的个人信息转移或披露给任何第三方，除非：</div>
        <div class="section weight">（1）相关法律法规或司法机关、行政机关要求。</div>
        <div class="section weight">（2）为完成合并、分立、收购或资产转让而转移。</div>
        <div class="section weight">（3）为提供您要求的服务所必需。</div>
        <div class="section weight">
          6.5全真云非常重视对未成年人个人信息的保护。若您不具备完全民事行为能力，在使用全真云的服务前，应事先取得您的监护人的同意。
        </div>
        <div class="title">七 使用本服务的方式</div>
        <div class="section">7.1本服务仅为您个人非商业性质的使用，除非您与全真云另有约定。</div>
        <div class="section">7.2您依本协议条款所取得的权利不可转让，除非您事先征得了全真云的同意。</div>
        <div class="section">
          7.3您不得使用任何方式（包括但不限于第三方软件、插件、外挂、系统、设备等）对本服务进行干扰、破坏、修改或施加其他影响。
        </div>
        <div class="section">7.4您应当通过全真云提供或认可的方式使用本服务，不得通过任何第三方软件、插件、外挂、系统、设备等登录或使用本服务。</div>
        <div class="section">
          7.5任何人未经全真云授权不得使用任何第三方软件、插件、外挂、系统等查看、获取本服务中所包含的全真云、全真云合作伙伴或用户的任何相关信息、数据等内容。
        </div>
        <div class="title">八 知识产权声明</div>
        <div class="section">
          8.1全真云在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表、计算机软件等）的知识产权归全真云所有，用户在使用本服务中所产生内容的知识产权归用户或相关权利人所有，除非您与全真云另有约定。
        </div>
        <div class="section">8.2除另有特别声明外，全真云提供本服务时所依托软件的著作权、专利权及其他知识产权均归全真云所有。</div>
        <div class="section">
          8.3上述及其他任何本服务包含的内容的知识产权均受到法律法规保护，未经全真云、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
        </div>
        <div class="title">九 用户行为规范</div>
        <div class="section">9.1您充分了解并同意，您必须为自己全真云账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。</div>
        <div class="section">
          9.2您除了可以按照本协议的约定使用全真云服务之外，不得进行任何侵犯全真云的知识产权的行为，或者进行其他的有损于全真云或其他第三方合法权益的行为。
        </div>
        <div class="section weight">9.3您在使用全真云服务时须遵守法律法规，不得利用全真云服务从事违法违规行为，包括但不限于以下行为：</div>
        <div class="section weight">（一）违反宪法确定的基本原则的；</div>
        <div class="section weight">（二）危害国家统一、主权和领土完整的；</div>
        <div class="section weight">（三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；</div>
        <div class="section weight">（四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；</div>
        <div class="section weight">（五）宣扬邪教、迷信的；</div>
        <div class="section weight">（六）散布谣言，扰乱社会秩序，破坏社会稳定的；</div>
        <div class="section weight">（七）宣扬淫秽、色情、赌博、暴力，或者教唆犯罪的；</div>
        <div class="section weight">（八）侮辱、诽谤他人，侵害他人合法权益的；</div>
        <div class="section weight">（九）违背社会公德的；</div>
        <div class="section weight">（十）有法律、行政法规和国家规定禁止的其他内容的。</div>
        <div class="section weight">9.4除非法律允许或全真云书面许可，您不得从事下列行为：</div>
        <div class="section weight">（1）删除全真云及其副本上关于著作权的信息；</div>
        <div class="section weight">（2）对全真云进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码；</div>
        <div class="section weight">（3）对全真云进行扫描、探查、测试，以检测、发现、查找其中可能存在的BUG或弱点；</div>
        <div class="section weight">
          （4）对全真云或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；
        </div>
        <div class="section weight">
          （5）修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；
        </div>
        <div class="section weight">
          （6）通过非全真云开发、授权的第三方软件、插件、外挂、系统，使用全真云服务，或制作、发布、传播非全真云开发、授权的第三方软件、插件、外挂、系统；
        </div>
        <div class="section weight">
          （7）对服务中全真云拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
        </div>
        <div class="section weight">
          （8）建立有关全真云的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与全真云服务完全相同或者类似的服务；
        </div>
        <div class="section weight">（9）将全真云的任意部分分离出来单独使用，或者进行其他的不符合本协议的使用；</div>
        <div class="section weight">（10）使用、修改或遮盖全真云的名称、商标或其它知识产权；</div>
        <div class="section weight">
          （11）通过全真云提供的或者明确许可的软件或服务以外的任何软件或者服务注册、获取全真云账号；或者通过任何软件或服务；
        </div>
        <div class="section weight">（12）以非人工、非手动方式注册全真云账号；或者频繁、批量注册、获取全真云账号；</div>
        <div class="section weight">（13）其他通过全真云非明确许可的方式或目的注册、获取或使用全真云账号的行为；</div>
        <div class="section weight">
          （14）全真云根据本规则对账号的使用授权，仅限于初始申请注册人。未经许可，初始申请注册人不得赠与、借用、租用、转让或售卖全真云账号或者以其他方式许可其他主体使用账号；
        </div>
        <div class="section weight">（15）非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用全真云账号；</div>
        <div class="section weight">（16）违反与全真云网络相联通之网络、设备或服务的操作规定；</div>
        <div class="section weight">
          （17）进行任何改变或试图改变全真云及/或全真云合作方提供的系统配置或破坏系统安全的行为，包括但不限于以病毒、木马、恶意代码、钓鱼等方式，对网站、服务器进行恶意扫描、非法侵入、非法获取数据等；
        </div>
        <div class="section weight">
          （18）建立或利用有关设备、配置运行与所使用服务无关的程序或进程，导致大量占用服务器内存、CPU/GPU或者网络带宽资源，给全真云的系统或者其他客户所使用的网络、服务器、产品/服务等带来严重的负荷，影响全真云服务与互联网或者与特定网络、服务器及全真云服务内部的通畅联系，或者导致您自己或他人的服务器宕机、死机或者他人的产品或服务不可访问等；
        </div>
        <div class="section weight">（19）利用技术或其他手段破坏、扰乱全真云服务的运营或他人使用全真云服务；</div>
        <div class="section weight">
          （20）以任何方式干扰或企图干扰全真云任何产品或任何部分、功能的正常运行，或者制作、发布、传播上述工具、方法等；
        </div>
        <div class="section weight">（21）其他未经全真云明示授权的行为。</div>
        <div class="section weight">
          9.5您在使用全真云服务过程中如有以下任何行为（以下也称“违法违规行为”）之一的，全真云有权视情节严重程度，依据本协议及相关全真云规则的规定，对您采取本协议
        </div>
        <div class="section weight">9.6款规定的一种或多种处理措施，并可公告处理结果：</div>
        <div class="section weight">（1）利用平台漏洞、或其他技术手段、损害全真云利益行为；</div>
        <div class="section weight">（2）使用过程无端对服务人员谩骂及人身攻击的行为；</div>
        <div class="section weight">
          （3）违规及（或）恶意注册、登录全真云的行为，包括但不限于恶意批量注册全真云账号，以及以破坏服务器鉴权、恶意挤服等方式登录全真云行为；
        </div>
        <div class="section weight">（4）传播非法言论或不当信息；</div>
        <div class="section weight">（5）盗取他人全真云账号；</div>
        <div class="section weight">（6）进行全真云账号交易、账号共享等影响账号安全的行为；</div>
        <div class="section weight">
          （7）未经全真云许可，擅自与其他用户进行全真云账户虚拟交易等，或从第三方通过购买、接受赠与或者其他式获得全真云服务的；
        </div>
        <div class="section weight">
          （8）在未经全真云授权或认可的折扣渠道进行全真云服务充值或委托未获全真云授权或认可的第三方代为充值，或者使用未经全真云授权或认可的第三方软件充值；
        </div>
        <div class="section weight">（9）违反本协议任何约定，或违反国家法律法规任何规定的行为；</div>
        <div class="section weight">（10）其他在行业内被广泛认可的不当行为。</div>
        <div class="section weight">9.6本协议9.4及9.5款规定的处理措施包括但不限于：</div>
        <div class="section weight">（1）警告；及/或</div>
        <div class="section weight">（2）删除或注销全真云账号、全真云数据或其他全真云相关信息；及/或</div>
        <div class="section weight">（3）限制或禁止您进入全真云特定的场景或使用全真云特定功能；及/或</div>
        <div class="section weight">（4）暂时或永久性地禁止您全真云账号登录全真云（以下称“封号”）；及/或</div>
        <div class="section weight">（5）暂时或永久性地禁止您违法违规行为涉及的特定终端（包括但不限于PC终端、移动终端等）登录全真云；及/或</div>
        <div class="section weight">（6）暂停或终止您使用全真云及相关服务，技术手段删除、屏蔽相关内容或断开链接等。或单方通知您终止本协议；及/或</div>
        <div class="section weight">
          （7）就您的违法违规行为提起相应民事诉讼，追究您的侵权、违约或其他民事责任，并要求您赔偿上海芯赛云计算科技有限公司因您违法违规行为所受到的损失（包括上海芯赛云计算科技有限公司所受到的直接经济损失、名誉或商誉损失以及上海芯赛云计算科技有限公司对外支付的赔偿金、和解费用、律师费用、诉讼费用及其他间接损失），或移交有关行政管理机关给予行政处罚，或者移交司法机关追究您的刑事责任；及/或
        </div>
        <div class="section weight">（8）全真云通过全真云服务规则（包括但不限于用户守则、全真云公告、提示及通知）公布的其他处理措施。</div>
        <div class="section weight">
          9.7您知悉并同意，如全真云依据本协议对您的全真云账号采取封号处理措施的，具体封号期间由全真云根据您违规行为情节而定。在封号期间，您全真云服务账号中的虚拟货币可能都将无法使用。
        </div>
        <div class="title">十 全真云权责</div>
        <div class="section">10.1按照本协议约定向您提供实时渲染云服务。全真云提供的本服务需达到《全真云实时渲染云服务使用协议》约定的服务标准。</div>
        <div class="section">
          10.2全真云有权以网页公告、网页提示、电子邮件、手机短信、站内信等方式中的一种或多种，向您送达关于本服务的各种通知、提示、广告等信息。
        </div>
        <div class="section">10.3全真云负责对本服务的相关技术架构及操作系统进行维护和技术支持。</div>
        <div class="section">10.4您理解并同意，全真云保留随时修改、取消、增强实时渲染云计算服务中一项或多项功能的权利。</div>
        <div class="section">
          10.5如您违反本服务条款的约定，或全真云根据自己的独立判断认为您使用实时渲染云计算不符合全真云的要求，全真云将遵循本协议约定的防护规则对您的与实时渲染云计算相关联的全真云服务采取必要操作，且有权暂停或终止向您提供本服务。全真云或其他任何第三方因此遭受的损失，由您承担。
        </div>
        <div class="section weight">
          10.6发生下列任何一种情形，全真云有权随时中止向您提供本协议项下的服务而无需通知您，对因此而产生的不便或损害，全真云对您或第三人均不承担任何责任：
        </div>
        <div class="section weight">（1）定期检查或施工，更新软硬件等；</div>
        <div class="section weight">（2）服务器遭受损坏，无法正常运作；</div>
        <div class="section weight">（3）突发性的软硬件设备与电子通信设备故障；</div>
        <div class="section weight">（4）网络提供商线路或其它故障；</div>
        <div class="section weight">（5）在紧急情况之下为维护国家安全或其它您及第三者之人身安全；</div>
        <div class="section weight">（6）您和/或最终您违反本协议之相关规定的；</div>
        <div class="section weight">（7）不可抗力及其他第三方原因。</div>
        <div class="section weight">十一 不可抗力及免责</div>
        <div class="section weight">
          11.1您理解并同意，在使用实时渲染云服务的过程中可能会遇到以下情况使服务发生中断。出现下述情况给客户造成的损失全真云将免责：
        </div>
        <div class="section weight">
          （1）不可抗力，包括但不限于自然灾害、政府行为、政策颁布调整、法律法规颁布调整、罢工、动乱，及其他不可预见、不可避免并不能克服的客观情况；
        </div>
        <div class="section weight">
          （2）基础运营商的作为或不作为，包括但不限于电信部门技术调整、电信/电力线路被他人破坏、电信/电力部门对电信网络/电力资源进行安装、改造、维护；
        </div>
        <div class="section weight">（3）网络安全事故，如计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</div>
        <div class="section weight">（4）您操作不当或您的电脑软件、系统、硬件和通信线路出现故障等；</div>
        <div class="section weight">（5）由于运营商骨干通路上偶然阻塞造成访问速度下降，在对服务器进行设置或安装用户程序时可能产生的服务中断；</div>
        <div class="section weight">
          （6）根据政府相关部门的监管要求采取相应措施致服务中断的，如主管部门下达涉及您的账户、服务、设备的禁令或类似通知的；
        </div>
        <div class="section weight">（7）其他非全真云过错、全真云无法控制或合理预见的情形。</div>
        <div class="section">
          11.2因不可抗力，双方在本协议中的义务在不可抗力影响范围及其持续期间内将中止履行。任何一方均不会因此而承担责任。声称遭受不可抗力的一方应在不可抗力发生后不迟于十五日通知另一方，并随附经有关部门确认的不可抗力书面证明，且应尽可能减少不可抗力所产生之影响。
          如发生不可抗力，双方应立即协商解决问题的方案。如果不可抗力持续三十日以上，且对本协议之履行产生重大不利影响，则任何一方均可终止本协议。
        </div>
        <div class="section weight">11.3在任何情况下，不可抗力不得免除您的付款义务。</div>
        <div class="section">
          11.4在任何情况下，全真云均不对任何间接性、后果性、惩戒性、偶然性、特殊性的损害，包括您使用全真云服务而遭受的利润损失承担责任（即使您已被告知该等损失的可能性）。
        </div>
        <div class="section weight">11.5在任何情况下，全真云对本服务条款所承担的违约赔偿责任总额不超过向您收取的本服务的服务费总额。</div>
        <div class="title">十二 协议的生效与变更</div>
        <div class="section weight">12.1您使用本服务即视为您已阅读本协议并接受本协议的约束。</div>
        <div class="section">12.2全真云有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条款。</div>
        <div class="section">12.3本协议条款变更后，如果您继续使用全真云提供的软件或服务，即视为您已接受变更后的协议。</div>
        <div class="title">十三 服务的变更、中断、终止</div>
        <div class="section">13.1您理解并同意，全真云基于经营策略的调整，可能会对服务内容进行变更，也可能会中断、中止或终止服务。</div>
        <div class="section weight">
          13.2在上海芯赛云计算科技有限公司发生合并、分立、收购、资产转让时，上海芯赛云计算科技有限公司可向第三方转让本服务下相关资产；全真云也可在单方通知您后，将本协议下部分或全部服务及相应的权利义务转交由第三方运营或履行。具体受让主体以全真云通知的为准。
        </div>
        <div class="section weight">13.3如发生下列任何一种情形，全真云有权不经通知而中断或终止向您提供服务：</div>
        <div class="section weight">（1）根据法律法规规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明。</div>
        <div class="section weight">（2）您违反相关法律法规的规定或违反本协议的约定。</div>
        <div class="section weight">（3）按照法律法规规定，司法机关或主管部门的要求。</div>
        <div class="section weight">（4）出于安全的原因或其他必要的情形。</div>
        <div class="section">13.4全真云有权按本协议的第四条款的约定进行收费。若您未按时足额付费，全真云有权中断、中止或终止提供服务。</div>
        <div class="section">
          13.5您有责任自行备份存储在本服务中的数据。如果您的服务被终止，全真云有权从服务器上永久地删除您的数据,法律法规另有规定的除外。服务中止或终止后，全真云没有义务向您提供或返还数据。
        </div>
        <div class="title">十四 管辖与法律适用</div>
        <div class="section">14.1本协议的成立、生效、履行、解释及纠纷解决等相关事宜，均适用中华人民共和国大陆地区法律（不包括冲突法）。</div>
        <div class="section">
          14.2若您和全真云之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交由上海芯赛云计算科技有限公司注册地有管辖权的人民法院管辖。
        </div>
        <div class="section">14.3本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</div>
        <div class="section">
          14.4本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。若本协议有中文、英文等多个语言版本，相应内容不一致的，均以中文版的内容为准。
        </div>
        <div class="title">十五 未成年人使用条款</div>
        <div class="section">15.1若用户未满18周岁，则为未成年人，应在监护人监护、指导下阅读本协议和使用本服务。</div>
        <div class="section">15.2已满18周岁的成年人因任何原因不具备完全民事行为能力的，参照适用本协议之未成年人使用条款之相关约定。</div>
        <div class="section">
          15.3对于经监护人同意而收集的未满14周岁的未成年个人信息的情况，我们只会在受到法律允许、监护人明确同意或者保护未满14周岁的未成年人所必要的情况下使用或披露此个人信息。
        </div>
        <div class="section">
          15.4如果我们发现自己在未事先获得可证实的监护人同意的情况下，收集了未满14周岁的未成年人的个人信息，则会设法尽快删除相关个人信息。
        </div>
        <div class="title">十六 其他</div>
        <div class="section">
          16.1一方免予追究另一方一次或多次未履行本协议义务相关责任的，不得被解释为对任何随后的违反协议或不履行本协议责任的不予追究。一方于另一方违约后继续履行本协议的，不得被视为对另一方违约责任的免于追究。
        </div>
        <div class="section">
          16.2如果您对本协议或本服务有意见或建议，可与（https://www.quanzhencloud.top）全真云客户服务部门联系，我们会给予您必要的帮助。
        </div>
        <div class="end">（正文完）</div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style lang="less">
  .login-logo {
    position: fixed;
    top: 15px;
    left: 40px;
    color: @MainColor;
    height: 64px;
    display: flex;
    z-index: 10;
    svg {
      width: 92px;
      height: 30px;
    }
  }
  .agreement {
    display: flex;
    justify-content: center;
    padding-left: 140px;
    .agreement-content {
      width: 1200px;
      padding-top: 100px;
      font-family: "PingFang SC";
      font-style: normal;
      padding: 24px;
      .headline {
        font-weight: 600;
        font-size: 20px;
        color: #333333;
        padding-top: 50px;
      }
      .effect {
        font-weight: 600;
        font-size: 14px;
        color: #333333;
        padding-top: 24px;
      }
      .title {
        padding: 24px 0;
        font-weight: 600;
        font-size: 16px;
        line-height: 22px;
        color: #333333;
      }
      .title2 {
        font-weight: 600;
        font-size: 14px;
        line-height: 20px;
        color: #333333;
      }
      .section {
        font-weight: 400;
        font-size: 14px;
        line-height: 20px;
        color: #666666;
      }
      .weight {
        font-weight: 600;
        color: #333333;
      }
      .end {
        padding: 20px 0 100px;
        text-align: center;
      }
    }
  }
</style>
